app/views/comments/_comment.html.erb

  <strong>
  	<%= comment.user.firstname.present? ?  comment.user.firstname : comment.user.email%> said :
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1