app/views/games/_form.html.erb

    <%= f.label :category_id %><br>
    <%= f.select :category_id, options_for_select(Category.all.map{ |c| [c.title, c.id] }, :selected => params[:category_id]) %>
---
SELECT "categories".* FROM "categories"