app/views/games/index.html.erb

        <td><%= game.category.title %></td>
        <td><%= game.user.firstname %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1