app/views/games/show.html.erb

  <strong>User:</strong>
  <%= @game.user.firstname %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1