app/controllers/comments_controller.rb

 def create
  @game = Game.find(params[:game_id])
  @comment = @game.comments.create(comment_params)
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("created_at", "game_id", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 18 Mar 2017 06:42:49 UTC +00:00], ["game_id", 1], ["message", "sample sample sample"], ["updated_at", Sat, 18 Mar 2017 06:42:49 UTC +00:00], ["user_id", 1]]

  def destroy
    @game = Game.find(params[:game_id])
    @comment = @game.comments.find(params[:id])
    @comment.destroy
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."game_id" = ? AND "comments"."id" = ? LIMIT 1  [["game_id", 1], ["id", "1"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]