app/controllers/games_controller.rb

SELECT "games".* FROM "games"
SELECT "categories".* FROM "categories"
SELECT "games".* FROM "games" WHERE "games"."category_id" = 2
---
  def index
    # return render :text => ENV['myname'].inspect
    # to show only login user's games
    # Option-1
    #@games = current_user.games
    # Option -2
    # @games = Game.where(:user_id => current_user.id)
    @games = Game.all
    # ------------------------------
    # all games..
    @categories = Category.all
    if params[:c_id].present?
      @games = Game.where(:category_id => params[:c_id])

INSERT INTO "games" ("category_id", "created_at", "name", "price", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["category_id", 2], ["created_at", Fri, 10 Mar 2017 15:08:22 UTC +00:00], ["name", "u1"], ["price", 100], ["updated_at", Fri, 10 Mar 2017 15:08:22 UTC +00:00], ["user_id", 1]]
---
  def create
    @game = Game.new(game_params)
    @game.save

UPDATE "games" SET "name" = ?, "category_id" = ?, "updated_at" = ? WHERE "games"."id" = 1  [["name", "Game - 1"], ["category_id", 4], ["updated_at", Fri, 10 Mar 2017 15:09:57 UTC +00:00]]
---
  def update
    @game.update(game_params)

SELECT "games".* FROM "games" WHERE "games"."id" = ? ORDER BY "games"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_game
      @game = Game.find(params[:id])